Revit 2026 API

# ExportPatternKey Properties

---

The ExportPatternKey type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | OriginalFillPatternName | The original FillPattern name. |
|  | OriginalFillPatternType | The original FillPattern type. |

#### Reference

ExportPatternKey Class

Autodesk.Revit.DB Namespace